%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
                    %%%% Programing parameters %%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
Cycles = 100;      % Number of cycles
T = 80;            % Span in time domain unit: ps
N = 2^10;          % Number of sample points
t_temp = linspace(-T/2,T/2,N+1)';     % Time vector   1025����
t = t_temp(1:N);   % Time series      1024���㣨������
Dt = T/N;          % Time domain sampling period    ��������λ������
omega = (2*pi/T.*(-N/2:1:(N/2-1)))';  % Circular frequency sequence unit��rad/ps
w = fftshift(omega);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
C_vacuum = 2.998e-4;%  unit: m/ps   ����ٶ�
Lambda0 = 1030e-9;%  unit: m  ���Ĳ���
lambda = 2*pi*C_vacuum./(omega+2*pi*C_vacuum/Lambda0);% unit m
lmda=lambda*1e9-Lambda0*1e9;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  Initial signal
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%Wide_seed = 5; % Seed pulse duration (full width half maximum) unit:ps
%E_seed = 1e-5; % Seed pulse energy unit:pJ
%at_in = initinal(t,Wide_seed,2,E_seed);
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%  gain fiber
B2_g = 1e-4;    % ps^2/m
Gm_g = 0.0031;   % 1/(W*m)
L_g=1;
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%%%%% gain g = G0./(1+trapz(t,abs(at).^2)/Es_g) parameter %%%%%
G0 = 3.6;                % unit:1/m С�ź�����ϵ��
w = fftshift(omega);   %��-N/2��+N/2����λ�ã����ı�ͼ����״�������ı���ֵ�����ͻ����ֵ��
Es_g = 80;             % pJ ��Ч��������
Dx_g = 50e-9;          % m �������
Dw_g = 2*pi*2.998e-4*Dx_g/Lambda0^2;  % unit:rad/ps,THz  Ƶ������������ֵԽС�˲�Խ���ԣ�
%%%%%%%%% Filter parameter %%%%%%%%%%%%%%%%%%%%
Dx_f=4.506e-9;     %�˲�����
Dw_f = 2*pi*2.998e-4*Dx_f/Lambda0.^2; % unit:rad/ps,THz Ƶ����˲�����
Loss_f = 0.01;         % Loss             �������
%%%%%%%%% single mode fiber %%%%%%%%%%%%%%%%%%%
B2_sm1 = 1e-4;        % Beta2_s1, ps^2/m����23e-3 ��ģ���˵�ɫɢ��
Gm_sm1 = 3.1e-3;       % 1/(W*m)    ��ģ���˵ķ�������
L1=0.5;%���˳���/m
L2=0.5;%���˳���/m
L3=1;%���˳���/m
L4=0.5;%���˳���/m
%%%%%%%%% saturation absorber parameter %%%%%%%%%%%%%%%
Md=0.448;           %�������       ���͸����-���͸���� ��λ��% ����ע�뵽�ɱ���������ʱ�����ʵ����仯����������ɱ������������ĵĹ����������SESAM��Ư�׵�������
A_ns = 0.4;       % nonsaturation loss �Ǳ������ 100%͸���ʡ�������ȣ����͸���ʣ�������ͨ��Զ���ڱ�������ͨ��ʱ����Ȼ���ڵ���ģ�
Ps = 20;          % saturation power  ���͹��� ������ȶ�Ӧ�Ĺ��ʣ������͸���ʶ�Ӧ�Ĺ��ʣ�
%%%%%%%%%%%%%% output coupler %%%%%%%%%%%%%%%%%%%%%%%%%%%
cc=0.8;  %����ٷֱ�
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%